// var i, j;
// for (i = 0; i < 4; i++) {
//     for (j = 0; j < 4; j++) {
//         document.write('<img src="img/1.png">');
//     }
//     document.write('<br>');
// }

var a1 = [[5, 5, 5, 5]]
var a2 = [[5], [5], [5], [5]]
//反L
var b1 = [[0, 2], [0, 2], [2, 2]]
var b2 = [[2, 0, 0], [2, 2, 2]]
var b3 = [[2, 2], [2, 0], [2, 0]]
var b4 = [[2, 2, 2], [0, 0, 2]]
//反T
var c1 = [[0, 3, 0], [3, 3, 3]]
var c2 = [[3, 0], [3, 3], [3, 0]]
var c3 = [[3, 3, 3], [0, 3, 0]]
var c4 = [[0, 3], [3, 3], [0, 3]]
//反Z
var d1 = [[0, 4, 4], [4, 4, 0]]
var d2 = [[4, 0], [4, 4], [0, 4]]
//Z
var e1 = [[6, 6, 0], [0, 6, 6]]
var e2 = [[0, 6], [6, 6], [6, 0]]
//L
var f1 = [[7, 0], [7, 0], [7, 7]]
var f2 = [[7, 7, 7], [7, 0, 0]]
var f3 = [[7, 7], [0, 7], [0, 7]]
var f4 = [[0, 0, 7], [7, 7, 7]]
//4x4
var g1 = [[1, 1], [1, 1]]

//长宽
var a11 = [4, 1]
var a22 = [1, 4]

var b11 = [2, 3]
var b22 = [3, 2]
var b33 = [2, 3]
var b44 = [3, 2]

var c11 = [3, 2]
var c22 = [2, 3]
var c33 = [3, 2]
var c44 = [2, 3]

var d11 = [3, 2]
var d22 = [2, 3]

var e11 = [3, 2]
var e22 = [2, 3]

var f11 = [2, 3]
var f22 = [3, 2]
var f33 = [2, 3]
var f44 = [3, 2]

var g11 = [2, 2]

var x = [a1, a2, b1, b2, b3, b4, c1, c2, c3, c4, d1, d2, e1, e2, f1, f2, f3, f4, g1]
var y = [a11, a22, b11, b22, b33, b44, c11, c22, c33, c44, d11, d22, e11, e22, f11, f22, f33, f44, g11]

var right=[1,0,3,4,5,2,7,8,9,6,11,10,13,12,15,16,17,14,18]
var left =[1,0,5,2,3,4,9,6,7,8,11,10,13,12,17,14,15,16,18]





// for (var i = 0; i < 19; i++) {
//     document.write("(" + i + "):  数组：" + x[i] + "---:--- 长宽：" + y[i] + "<br>");
//     document.write("===================<br><br>")
//     for (var j = 0; j < y[i][1]; j++) {
//         for (var k = 0; k < y[i][0]; k++) {
//             if (x[i][j][k] > 0) {
//                 document.write('<img src="img/' + String(x[i][j][k]) + '.png" >');
//             } else {
//                 document.write('<img src="img/0.png">');
//             }
//         }
//         document.write("<br>");
//     }
// }

